#+BASE_DIR: ../

*** describe_stacks

#+begin_src bash :results output :results block
rg -n "\.describe_stacks\(" ../src/cfn/
#+end_src

#+RESULTS:
: ../src/cfn/describe_stack_drift.rs:27:                .describe_stacks()
: ../src/cfn/delete_stack.rs:28:    let describe_request = context.client.describe_stacks().stack_name(stack_name);
: ../src/cfn/changeset_operations.rs:29:    let describe_request = context.client.describe_stacks().stack_name(stack_name);
: ../src/cfn/changeset_operations.rs:74:    let describe_request = context.client.describe_stacks().stack_name(stack_name);
: ../src/cfn/describe_stack.rs:25:                .describe_stacks()
: ../src/cfn/stack_operations.rs:44:            .describe_stacks()
: ../src/cfn/stack_operations.rs:289:            .describe_stacks()
: ../src/cfn/list_stacks.rs:83:        .describe_stacks()

Locations:
- [[file:../src/cfn/changeset_operations.rs::29][changeset_operations.rs:29 - check_stack_state]]
- [[file:../src/cfn/changeset_operations.rs::74][changeset_operations.rs:74 - check_stack_exists]]
- [[file:../src/cfn/create_or_update.rs::169][create_or_update.rs:169 - check_stack_exists]]
- [[file:../src/cfn/delete_stack.rs::27][delete_stack.rs:27 - check_stack_exists_for_delete]]
- [[file:../src/cfn/describe_stack.rs::25][describe_stack.rs:25 - describe_stack_impl]]
- [[file:../src/cfn/describe_stack_drift.rs::30][describe_stack_drift.rs:30 - describe_stack_drift_impl]]
- [[file:../src/cfn/list_stacks.rs::82][list_stacks.rs:82 - list_stacks_impl]]
- [[file:../src/cfn/stack_operations.rs::43][stack_operations.rs:43 - collect_stack_contents]]
- [[file:../src/cfn/stack_operations.rs::288][stack_operations.rs:288 - StackInfoService::get_stack]]

*** create_stack

#+begin_src bash
rg -n "\.create_stack\(" ../src/cfn/
#+end_src

#+RESULTS:
: ../src/cfn/request_builder.rs:60:            .create_stack()

Locations:
- [[file:../src/cfn/request_builder.rs::60][request_builder.rs:60 - CfnRequestBuilder::build_create_stack]]

*** update_stack

#+begin_src bash
rg -n "\.update_stack\(" ../src/cfn/
#+end_src

#+RESULTS:
: ../src/cfn/request_builder.rs:208:            .update_stack()

Locations:
- [[file:../src/cfn/request_builder.rs::208][request_builder.rs:208 - CfnRequestBuilder::build_update_stack]]

*** create_change_set

#+begin_src bash
rg -n "\.create_change_set\(" ../src/cfn/
#+end_src

#+RESULTS:
| ../src/cfn/changeset_operations.rs:216: | .create_change_set() |
| ../src/cfn/request_builder.rs:316:      | .create_change_set() |

Locations:
- [[file:../src/cfn/changeset_operations.rs::216][changeset_operations.rs:216 - perform_changeset_creation]]
- [[file:../src/cfn/request_builder.rs::316][request_builder.rs:316 - CfnRequestBuilder::build_create_changeset]]

